architecture/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-23 Fri 15:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DOTMG Architecture</title>
<meta name="author" content="Amrit" />
<meta name="description" content="Document defining the architecture of the dotmg program." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">DOTMG Architecture</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7718e07">1. How to configure <code>dotmg</code>?</a></li>
<li><a href="#orge39c3f4">2. How should <code>dotmg</code> handle basic syncing of files.</a></li>
<li><a href="#orgd73336a">3. Adding files</a>
<ul>
<li><a href="#orgea6f2df">3.1. Usage</a></li>
<li><a href="#orgf8ff149">3.2. Copying Operation</a></li>
<li><a href="#orgd9f0274">3.3. Maintaining a <code>config</code></a></li>
</ul>
</li>
<li><a href="#orgf47b528">4. Syncing Files</a></li>
</ul>
</div>
</div>
<p>
The goal of this program is to keep (dot)files in $HOME version
controlled and in sync using a version control program, such as
<code>git</code>. This isn't only specific to files but rather all directories
and files in <code>$HOME</code>.
This document reflects my preferences which will affect the
implementation of the program.
</p>

<div id="outline-container-org7718e07" class="outline-2">
<h2 id="org7718e07"><span class="section-number-2">1.</span> How to configure <code>dotmg</code>?</h2>
<div class="outline-text-2" id="text-1">
<p>
The goal is to have a <code>config</code> file in
<code>${XDG_CONFIG_HOME}/dotmg/</code>. My initial goal is to only have
a list of repositories in there and pass other configuration
parameters exist in the user's environment.
</p>

<p>
A hypothetical list of environment variables that affect <code>dotmg</code>
runtime:
</p>
<ul class="org-ul">
<li><code>$DOTMG_REPO_DIR</code>: The directory where the actual git repo exists
and files listed in <code>config</code> are copied over and then synced.</li>
<li><code>$DOTMG_CONFIG_DIR</code>: The directory where the <code>config</code> file exits.
Ideally, if <code>$XDG_CONFIG_HOME</code> exists, then the variable is set
optionally set to <code>$XDG_CONFIG_HOME/dotmg/</code>, otherwise it is
assumed set to <code>$HOME/.config/dotmg/</code>. The <i>optionally</i> here means
that if the <code>$DOTMG_CONFIG_DIR</code> variable is set in the user's
environment then it is directly used without any perviously
mentioned gymnastics.</li>
</ul>

<p>
An example <code>config</code> file:
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org9ccb1bf">$HOME/.config/sway
$HOME/.config/nvim
$HOME/.emacs.d/
$HOME/.zshrc
$HOME/.zprofile
Pictures/Wallpapers/mountains.png
</pre>
</div>

<p>
This file contains a newline separated list of files and directories.
</p>
</div>
</div>

<div id="outline-container-orge39c3f4" class="outline-2">
<h2 id="orge39c3f4"><span class="section-number-2">2.</span> How should <code>dotmg</code> handle basic syncing of files.</h2>
<div class="outline-text-2" id="text-2">
<p>
The idea here is to keep either entire directories or files in sync
by copying them over to <code>$DOTMG_REPO_DIR</code> and then performing a
series of version control commands that would get them ready to
be synced to a remote repository. We could also possibly support
the copying of <code>DOTMG_REPO_DIR</code> to a local directory as an optional
parameter-to-a-sync-sub-command-that-exists-in-dotmg.
</p>
</div>
</div>

<div id="outline-container-orgd73336a" class="outline-2">
<h2 id="orgd73336a"><span class="section-number-2">3.</span> Adding files</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgea6f2df" class="outline-3">
<h3 id="orgea6f2df"><span class="section-number-3">3.1.</span> Usage</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Exemplary use of <code>dotmg</code> may look like as follows:
</p>

<ul class="org-ul">
<li><code>dotmg add $HOME/.config/nvim</code>.</li>
<li><code>dotmg add ~/.ssh</code>.</li>
<li><code>dotmg add Pictures/Wallpapers/mountains.png</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgf8ff149" class="outline-3">
<h3 id="orgf8ff149"><span class="section-number-3">3.2.</span> Copying Operation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>dotmg</code> shall then strip away the user's <code>$HOME</code> expansion in path and re-create the directory
structure in <code>$DOTMG_REPO_DIR</code>. For arguments where the home directory is not directly present
in the path, e.g dotmg is run in a sub-directory inside <code>$HOME</code> then dotmg will simply re-create
the directory structure as-is and not check if the argument is a sub-directory in $HOME.
</p>

<p>
Example: <code>Pictures/Wallpapers</code> directory might be present in <code>$HOME/Media/Pictures/Wallpapers</code>,
then dotmg will not create the <code>Media</code> directory inside <code>$DOTMG_REPO_DIR</code> and instead create
<code>Pictures/Wallpapers</code> directories and then copy over the <code>mountains.png</code> file to that directory.
</p>
</div>
</div>

<div id="outline-container-orgd9f0274" class="outline-3">
<h3 id="orgd9f0274"><span class="section-number-3">3.3.</span> Maintaining a <code>config</code></h3>
<div class="outline-text-3" id="text-3-3">
<p>
dotmg also maintains a list of "added" directories or files in <code>$DOTMG_CONFIG_DIR/config</code>. When
<code>dotmg add</code> is run, after performing the copy in the aforementioned manner, it checks if the same
argument is present in <code>config</code>, if it is not present then it is added to the newline separated
list. Although, if the file or directory to added isn't present directly in <code>$HOME</code> but is a sub-
directory, then <code>dotmg</code> may use <code>find</code> to locate the full path to that directory/file and then
add it to the <code>config</code> to make the <code>sync</code> command's job easier.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf47b528" class="outline-2">
<h2 id="orgf47b528"><span class="section-number-2">4.</span> Syncing Files</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>dotmg sync</code> reads <code>$DOTMG_CONFIG_DIR/config</code> line by line and performs the same copying operation as
<code>dotmg add</code> and then it could either of the following operations:
</p>

<ul class="org-ul">
<li><code>git add</code> the copied over argument when doing line-by-line read. Commit when operation is finished.</li>
<li><code>git add .</code> the copied over content after everything is done. Now either the <code>.</code> argument can be
passed over to git, or <code>dotmg</code> could create an array and pass it as argument to git which will only
add and commit the files to the repository. This latter behavior allows some flexibility from the
user side which I have not explored yet.</li>
</ul>

<p>
dotmg could optionally push to remote as well, I have not decided yet if we want the "push" to
be a separate command or just a part of the <code>dotmg sync</code> command.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 22 June 2023</p>
<p class="author">Author: Amrit</p>
<p class="date">Created: 2023-06-23 Fri 15:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>